<?php
   /*
    *  
    * 按运算符号的功能分为：
 *
 *    一、算术运算符    +   -  *  /  %  ++  --
 *    二、字符串运算符  .  
 *    三、赋值运算符    =   += -= *= /= %=  .= 
 *    四、比较运算符    >  <  >= <= == ===  != 或<> !== 
 *    五、逻辑运算符    && 或and  ||或 or  ! 或not   
 *    六、位运算符      &   ｜ ^ ~   <<  >> >>>
 *    七、其他运算符   ? :  ``  @  => -> ::  & $
    * 
    * */
  
  //判断闰年    能被4整除 但不能被100整除   或者能被400整除 
  
  $year = 2010;
  
  if( $year%4==0 && $year%100!=0  || $year%400==0){
  	echo "yes </br>";
  }else{
  	echo "no </br>";
  }

  $a =10;
  $b=$a++;  //$b=10  $a=11
  $c = --$b; //$c=9
  
  echo $c;  //9
  
  $d = $c++ + ++$c;  //9 +11=20;  9自加变成
  $e = $d-- - --$d;//20-18=2
  
  
  
  
  