<?php
header('Content-Type: text/html; charset=utf-8');
/* 
  自定义数组
  如果不自定义key, key默认从0开始
 */
$users=array('baidu'=>'李彦宏','alibaba'=>'马云','360'=>'周鸿祎');
//追加数组
$users['tencent']='马化腾';
echo '--------------------------------------<br/>';

foreach ($users as $key => $value) {
    echo $key.'----'.$value.'<br/>';
}


echo '--------------------dfg------------------<br/>';
//each的使用 返回数组中当前的键/值
//each 获取的是第一个键值对'baidu'=>'李彦宏'
//返回的是一个数组,将获取的键值对包装成一个新数组

$num=array('大笨钟'=>'英国','自由女神像'=>'美国','黑手党'=>'意大利','柏林'=>'德国');
$num['古罗马']='亚历山大';
 
$a = each($num);//变成新的数组 array('大笨钟','英国')
echo $a[1];
echo $a['key'];

echo '<br/>--------------------dfg------------------<br/>';
$num1=array('大笨钟'=>'英国','自由女神像'=>'美国','黑手党'=>'意大利','柏林'=>'德国');

//使用 each()结构打印$ages 数组的内容：each()函数返回数组的当前元素，并将下一个元素作为当前元素
//用!!判断 是否有数据  依次each($num1)赋值给$a 如果有数据就执行下面的
while ( !!$a =  each($num1) ){
    echo $a['key'].'---'.$a['value'].'<br/>';
}